package hw3_2_1;
// Задание: 2.1. Вывести таблицу умножения в консоль

public class Main {
     System.out.println("Задание 3.2.1!");
        System.out.println("Таблица умножения на 2 : ");
        for (int i = 1; i <= 10; i++) {
        System.out.println("2 * " + i + " = " + 2 * i);
    }
        System.out.println("Таблица умножения на 3 : ");
        for (int i = 1; i <= 10; i++) {
        System.out.println("3 * " + i + " = " + 3 * i);
    }

}
